# ============================================================================
# 8. 当該住戸の外皮の部位の面積等を用いて外皮性能を評価する方法
# ============================================================================

# ============================================================================
# 8.1 外皮平均熱貫流率
# ============================================================================

def get_U_A(**args):
    raise NotImplementedError()


# ============================================================================
# 8.2 暖房期の平均日射熱取得率及び冷房期の平均日射熱取得率
# ============================================================================

def get_eta_A_H(**args):
    raise NotImplementedError()


def get_eta_A_C(**args):
    raise NotImplementedError()


# ============================================================================
# 8.3 床面積の合計に対する外皮の部位の面積の合計の比
# ============================================================================

def get_r_env(A_env, A_A):
    """ 床面積の合計に対する外皮の部位の面積の合計の比 (7)

    :param A_env: 外皮の部位の面積の合計 (m2)
    :param A_A: 床面積の合計 (m2)
    :type A_A: float
    :return: 床面積の合計に対する外皮の部位の面積の合計の比
    :rtype: float
    """

    return A_env / A_A
